## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 23 to import, 12 to add, 28 to change, 12 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence02-datadisk-000-20250115-103537&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence04-datadisk-000-20250115-103905&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-000-20250115-110018&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-001-20250115-110018&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster02-datadisk-000-20250115-110126&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster03-datadisk-000-20250115-110154&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodjira01-datadisk-000-20250115-102743&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-confluence-02-nic-b84332a810274e879a33a6f38a7df04a&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-confluence-04-nic-4613cc6b09804b27aca60fa089ef0cb3&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-crowd-01-nic-6fab8d5cad484bbd8527a72a388d91d2&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-01-nic-9d7a4faa7a584b8a93625c8a890aaaa2&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-02-nic-5d520339a4a3439ea10b42309dd60d89&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-03-nic-789c1d7bf88c4ff2a65e0bffd22dd45c&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-01-nic-ae42a8594ebb446cb08f04a919d15177&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-02-nic-69fb98d7b08e4fd7a5cfd2d52d7a551e&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-03-nic-dc5e66a89abe413a9b6552cb7917a1fb&#34;]
  * azurerm_postgresql_server.atlassian-server
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * azurerm_virtual_machine.vm[&#34;atlassian-nonprod-jira-03&#34;]
* Replace
  * terraform_data.postgres[&#34;confluence&#34;]
  * terraform_data.postgres[&#34;crowd&#34;]
  * terraform_data.postgres[&#34;jira&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]
* Import
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence02-datadisk-000-20250115-103537&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodconfluence04-datadisk-000-20250115-103905&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-000-20250115-110018&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster01-datadisk-001-20250115-110018&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster02-datadisk-000-20250115-110126&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodgluster03-datadisk-000-20250115-110154&#34;]
  * azurerm_managed_disk.data_disk[&#34;atlassiannonprodjira01-datadisk-000-20250115-102743&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-confluence-02-nic-b84332a810274e879a33a6f38a7df04a&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-confluence-04-nic-4613cc6b09804b27aca60fa089ef0cb3&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-crowd-01-nic-6fab8d5cad484bbd8527a72a388d91d2&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-01-nic-9d7a4faa7a584b8a93625c8a890aaaa2&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-02-nic-5d520339a4a3439ea10b42309dd60d89&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-gluster-03-nic-789c1d7bf88c4ff2a65e0bffd22dd45c&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-01-nic-ae42a8594ebb446cb08f04a919d15177&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-02-nic-69fb98d7b08e4fd7a5cfd2d52d7a551e&#34;]
  * azurerm_network_interface.nic[&#34;atlassian-nonprod-jira-03-nic-dc5e66a89abe413a9b6552cb7917a1fb&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodconfluence02-datadisk-000-20250115-103537&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodconfluence04-datadisk-000-20250115-103905&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster01-datadisk-000-20250115-110018&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster01-datadisk-001-20250115-110018&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster02-datadisk-000-20250115-110126&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodgluster03-datadisk-000-20250115-110154&#34;]
  * azurerm_virtual_machine_data_disk_attachment.data_disk_attachment[&#34;atlassiannonprodjira01-datadisk-000-20250115-102743&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-crd" -> null
          - ip_addresses = [
              - "10.0.4.202",
            ] -> null
          - name         = "appgw-backend-pool-crd" -> null
        }
      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/backendAddressPools/appgw-backend-pool-jira" -> null
          - ip_addresses = [
              - "10.0.4.203",
              - "10.0.4.204",
              - "10.0.4.205",
            ] -> null
          - name         = "appgw-backend-pool-jira" -> null
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.196",
              + "10.0.4.198",
              + "10.0.4.199",
            ]
          + name         = "appgw-backend-pool-jira"
        }
      + backend_address_pool {
          + fqdns        = []
          + id           = (known after apply)
          + ip_addresses = [
              + "10.0.4.197",
            ]
          + name         = "appgw-backend-pool-crd"
        }

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (15 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_managed_disk.data_disk["atlassiannonprodconfluence02-datadisk-000-20250115-103537"] will be updated in-place
  # (imported from "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence02-datadisk-000-20250115-103537")
  ~ resource "azurerm_managed_disk" "data_disk" {
        create_option                     = "Import"
        disk_access_id                    = null
        disk_encryption_set_id            = null
        disk_iops_read_only               = 0
        disk_iops_read_write              = 500
        disk_mbps_read_only               = 0
        disk_mbps_read_write              = 100
        disk_size_gb                      = 128
        edge_zone                         = null
        gallery_image_reference_id        = null
        hyper_v_generation                = null
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence02-datadisk-000-20250115-103537"
        image_reference_id                = null
        location                          = "uksouth"
        max_shares                        = 0
        name                              = "atlassiannonprodconfluence02-datadisk-000-20250115-103537"
        on_demand_bursting_enabled        = false
        optimized_frequent_attach_enabled = false
        os_type                           = null
        performance_plus_enabled          = false
        public_network_access_enabled     = true
        resource_group_name               = "atlassian-nonprod-rg"
        secure_vm_disk_encryption_set_id  = null
        security_type                     = null
        source_resource_id                = null
        source_uri                        = "https://atlassiannonprod.blob.core.windows.net/atlassiannonprodconfluence02-fd2c49ab25f343f28c3a8b7021bd78b4/atlassiannonprodconfluence02-datadisk-000-20250115-103537.vhd"
        storage_account_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Storage/storageAccounts/atlassiannonprod"
        storage_account_type              = "Premium_LRS"
      ~ tags                              = {
          - "RSVaultBackup" = "1a92b5a4-ad64-46e8-8b3c-fb565f4cc4e8" -> null
            "application"   = "atlassian"
          + "autoShutdown"  = "true"
            "builtFrom"     = "hmcts/atlassian-infrastructure"
            "businessArea"  = "Cross-Cutting"
          + "criticality"   = "Medium"
            "environment"   = "staging"
          + "startupMode"   = "always"
        }
        tier                              = "P10"
        trusted_launch_enabled            

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ian-infrastructure"
          + "businessArea"    = "Cross-Cutting"
          - "creator"         = "SPT/terraform" -> null
          + "criticality"     = "Medium"
          - "domain"          = "cp.cjs.hmcts.net" -> null
          ~ "environment"     = "app_prd" -> "staging"
          - "expiration_date" = "none" -> null
          - "osfamily"        = "linux" -> null
          - "owner"           = "HMCTS-SP" -> null
          - "platform"        = "lv" -> null
          - "project"         = "atl" -> null
          - "role"            = "atl_gluster" -> null
          - "stack"           = "prdatl01" -> null
          + "startupMode"     = "always"
          - "tier"            = "app" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-nonprod-jira-01"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01"
        name                             = "atlassian-nonprod-jira-01"
      ~ tags                             = {
          - "ansible"         = "true" -> null
          + "application"     = "atlassian"
          + "autoShutdown"    = "true"
          + "builtFrom"       = "hmcts/atlassian-infrastructure"
          + "businessArea"    = "Cross-Cutting"
          - "creator"         = "SPT/terraform" -> null
          + "criticality"     = "Medium"
          - "domain"          = "cp.cjs.hmcts.net" -> null
          ~ "environment"     = "app_prd" -> "staging"
          - "expiration_date" = "none" -> null
          - "osfamily"        = "linux" -> null
          - "owner"           = "HMCTS-SP" -> null
          - "platform"        = "lv" -> null
          - "project"         = "atl" -> null
          - "role"            = "atl_jira" -> null
          - "stack"           = "prdatl01" -> null
          + "startupMode"     = "always"
          - "tier"            = "app" -> null
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-nonprod-jira-02"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-02"
        name                             = "atlassian-nonprod-jira-02"
      ~ tags                             = {
          - "ansible"         = "true" -> null
          + "application"     = "atlassian"
          + "autoShutdown"    = "true"
          + "builtFrom"       = "hmcts/atlassian-infrastructure"
          + "businessArea"    = "Cross-Cutting"
          - "creator"         = "SPT/terraform" -> null
          + "criticality"     = "Medium"
          - "domain"          = "cp.cjs.hmcts.net" -> null
          ~ "environment"     = "app_prd" -> "staging"
          - "expiration_date" = "none" -> null
          - "osfamily"        = "linux" -> null
          - "owner"           = "HMCTS-SP" -> null
          - "platform"        = "lv" -> null
          - "project"         = "atl" -> null
          - "role"            = "atl_jira" -> null
          - "stack"           = "prdatl01" -> null
          + "startupMode"     = "always"
          - "tier"            = "app" -> null
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_virtual_machine.vm["atlassian-nonprod-jira-03"] will be updated in-place
  ~ resource "azurerm_virtual_machine" "vm" {
        id                               = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-03"
        name                             = "atlassian-nonprod-jira-03"
      ~ tags                             = {
          - "ansible"         = "true" -> null
          + "application"     = "atlassian"
          + "autoShutdown"    = "true"
          + "builtFrom"       = "hmcts/atlassian-infrastructure"
          + "businessArea"    = "Cross-Cutting"
          - "creator"         = "SPT/terraform" -> null
          + "criticality"     = "Medium"
          - "domain"          = "cp.cjs.hmcts.net" -> null
          ~ "environment"     = "app_prd" -> "staging"
          - "expiration_date" = "none" -> null
          - "osfamily"        = "linux" -> null
          - "owner"           = "HMCTS-SP" -> null
          - "platform"        = "lv" -> null
          - "project"         = "atl" -> null
          - "role"            = "atl_jira" -> null
          - "stack"           = "prdatl01" -> null
          + "startupMode"     = "always"
          - "tier"            = "app" -> null
        }
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodconfluence02-datadisk-000-20250115-103537"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadOnly"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-02/dataDisks/atlassiannonprodconfluence02-datadisk-000-20250115-103537"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence02-datadisk-000-20250115-103537"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-02"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodconfluence04-datadisk-000-20250115-103905"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadOnly"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-04/dataDisks/atlassiannonprodconfluence04-datadisk-000-20250115-103905"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodconfluence04-datadisk-000-20250115-103905"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-confluence-04"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster01-datadisk-000-20250115-110018"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadWrite"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01/dataDisks/atlassiannonprodgluster01-datadisk-000-20250115-110018"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-000-20250115-110018"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster01-datadisk-001-20250115-110018"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "None"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01/dataDisks/atlassiannonprodgluster01-datadisk-001-20250115-110018"
        lun                       = 1
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster01-datadisk-001-20250115-110018"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-01"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster02-datadisk-000-20250115-110126"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadWrite"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-02/dataDisks/atlassiannonprodgluster02-datadisk-000-20250115-110126"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster02-datadisk-000-20250115-110126"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-02"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodgluster03-datadisk-000-20250115-110154"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadWrite"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03/dataDisks/atlassiannonprodgluster03-datadisk-000-20250115-110154"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodgluster03-datadisk-000-20250115-110154"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-gluster-03"
        write_accelerator_enabled = false
    }

  # azurerm_virtual_machine_data_disk_attachment.data_disk_attachment["atlassiannonprodjira01-datadisk-000-20250115-102743"] will be imported
    resource "azurerm_virtual_machine_data_disk_attachment" "data_disk_attachment" {
        caching                   = "ReadOnly"
        create_option             = "Attach"
        id                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01/dataDisks/atlassiannonprodjira01-datadisk-000-20250115-102743"
        lun                       = 0
        managed_disk_id           = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/disks/atlassiannonprodjira01-datadisk-000-20250115-102743"
        virtual_machine_id        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Compute/virtualMachines/atlassian-nonprod-jira-01"
        write_accelerator_enabled = false
    }

  # terraform_data.postgres["confluence"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "d40e9b92-63f0-1e0d-d176-80bcebb9e268" -> (known after apply)
      ~ triggers_replace = [
            # (2 unchanged elements hidden)
            "https://atlasssian-nonprod-kv.vault.azure.net/secrets/confluence-db-nonprod-postgres-username/6c585d3ebb284b52822375f326a01ed1",
          + "jdbc:postgresql://atlassian-nonprod-server.postgres.database.azure.com:5432",
        ]
    }

  # terraform_data.postgres["crowd"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "9b326afc-00bd-faef-d17c-0a5048113ae8" -> (known after apply)
      ~ triggers_replace = [
            # (2 unchanged elements hidden)
            "https://atlasssian-nonprod-kv.vault.azure.net/secrets/crowd-db-nonprod-postgres-username/2a6d0e45588c4fbeabcb9a14819fdde9",
          + "jdbc:postgresql://atlassian-nonprod-server.postgres.database.azure.com:5432",
        ]
    }

  # terraform_data.postgres["jira"] must be replaced
-/+ resource "terraform_data" "postgres" {
      ~ id               = "34a5ebfc-7e5a-d239-45b8-e26dceea746f" -> (known after apply)
      ~ triggers_replace = [
            # (2 unchanged elements hidden)
            "https://atlasssian-nonprod-kv.vault.azure.net/secrets/jira-db-nonprod-postgres-username/82c4e4a604864795979c11cde79787cf",
          + "jdbc:postgresql://atlassian-nonprod-server.postgres.database.azure.com:5432",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "bc68a036-add7-97d7-7352-883ad32a636b" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "945ef9ff-3543-cb6c-a439-3e69cdfaad66" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "d4ae73ed-245a-7012-92f5-34fd1271f4e1" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "6fd332f7-10b0-3aa9-fffe-98a7ba14d848" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "577eb03b-4d23-f338-e984-dd2163ac778c" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "988544f1-d91e-3c23-7ef1-00b801693e48" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "0982620c-ab12-e813-8eac-14fce2b0da9c" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "c0ffbbc3-8bba-3db1-e5cc-0098e5609e27" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "0683c766-748b-237a-35bf-1628b2e300fa" -> (known after apply)
      ~ triggers_replace = [
          ~ "4f47c63b3f8d4e692ed424faea423c10" -> "a236e58b10c342010389adabbd84dbca",
          ~ "bf78049cf222056d4dab3303ab59d43c" -> "cd354065f4313f526fefe14aa8383139",
          ~ "9f1990674e123a464618bccc7d0dddd7" -> "a5d1ee20089dd26a247bbf5e4bb96a25",
            "566bd0a7a2b3519848ee588db4cf8c55",
          ~ "9fecdb48848ea9cf50d1c5ecb5ef65d8" -> "316ccebb041567b8bc88a27fa2ecfd94",
        ]
    }

Plan: 23 to import, 12 to add, 28 to change, 12 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":48,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->